seanmlyons22/ti-lprf-pacs/svds/cc13x2_26x2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AON_EVENT</name>
      <baseAddress>0x40093000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <description>This module configures the event fabric located in the AON domain.

Note: This module is only supporting 32 bit ReadWrite access from MCU</description>
      <registers>
        <register>
          <name>MCUWUSEL</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Wake-up Selector For MCU

This register contains pointers to 4 of 8 events (events 0 to 3) which are routed to AON_PMCTRL as wakeup sources for MCU. AON_PMCTRL will start a wakeup sequence for the MCU domain when either of the 8 selected events are asserted. A wakeup sequence will guarantee that the MCU power switches are turned on, LDO resources are available and SCLK_HF is available and selected as clock source for MCU.

Note: It is required to setup a wakeup event in AON_EVENT before MCU is requesting powerdown ( PRCM requests uLDO, see conditions in PRCM:VDCTL.ULDO ).</description>
          <fields>
            <field>
              <name>RESERVED30</name>
              <description>[31:30] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>WU3_EV</name>
              <description>[29:24] MCU Wakeup Source #3

AON Event Source selecting 1 of 8 events routed to AON_PMCTRL for waking up the MCU domain from Power Off or Power Down.
Note:</description>
              <bitWidth>6</bitWidth>
              <bitOffset>24</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>63</value>
                  <description>No event, always low</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB_ASYNC_N</name>
                  <value>56</value>
                  <description>Comparator B not triggered. Asynchronous signal directly from AUX Comparator B (inverted) as opposed to AUX_COMPB which is synchronized in AUX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB_ASYNC</name>
                  <value>55</value>
                  <description>Comparator B triggered. Asynchronous signal directly from the AUX Comparator B as opposed to AUX_COMPB which is synchronized in AUX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_VOLT</name>
                  <value>54</value>
                  <description>BATMON voltage update event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_TEMP</name>
                  <value>53</value>
                  <description>BATMON temperature update event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER1_EV</name>
                  <value>52</value>
                  <description>AUX Timer 1 Event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER0_EV</name>
                  <value>51</value>
                  <description>AUX Timer 0 Event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TDC_DONE</name>
                  <value>50</value>
                  <description>TDC completed or timed out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_DONE</name>
                  <value>49</value>
                  <description>ADC conversion completed</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <value>48</value>
                  <description>Comparator B triggered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <value>47</value>
                  <description>Comparator A triggered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SWEV2</name>
                  <value>46</value>
                  <description>AUX Software triggered event #2. Triggered by AUX_EVCTL:SWEVSET.SWEV2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SWEV1</name>
                  <value>45</value>
                  <description>AUX Software triggered event #1. Triggered by AUX_EVCTL:SWEVSET.SWEV1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SWEV0</name>
                  <value>44</value>
                  <description>AUX Software triggered event #0. Triggered by AUX_EVCTL:SWEVSET.SWEV0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JTAG</name>
                  <value>43</value>
                  <description>JTAG generated event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_UPD</name>
                  <value>42</value>
                  <description>RTC Update Tick (16 kHz signal, i.e. event line toggles value every 32 kHz clock period)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_COMB_DLY</name>
                  <value>41</value>
                  <description>RTC combined delayed event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH2_DLY</name>
                  <value>40</value>
                  <description>RTC channel 2 - delayed event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH1_DLY</name>
                  <value>39</value>
                  <description>RTC channel 1 - delayed event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH0_DLY</name>
                  <value>38</value>
                  <description>RTC channel 0 - delayed event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH2</name>
                  <value>37</value>
                  <description>RTC channel 2 event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH1</name>
                  <value>36</value>
                  <description>RTC channel 1 event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH0</name>
                  <value>35</value>
                  <description>RTC channel 0 event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD</name>
                  <value>32</value>
                  <description>Edge detect on any PAD</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_COMBINED</name>
                  <value>9</value>
                  <description>Combined event from BATMON</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_TEMP_LL</name>
                  <value>8</value>
                  <description>BATMON event: Temperature level below lower limit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_TEMP_UL</name>
                  <value>7</value>
                  <description>BATMON event: Temperature level above upper limit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_BATT_LL</name>
                  <value>6</value>
                  <description>BATMON event: Battery level below lower limit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_BATT_UL</name>
                  <value>5</value>
                  <description>BATMON event: Battery level above upper limit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV3</name>
                  <value>4</value>
                  <description>Event 3 from AUX TImer2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV2</name>
                  <value>3</value>
                  <description>Event 2 from AUX TImer2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV1</name>
                  <value>2</value>
                  <description>Event 1 from AUX TImer2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV0</name>
                  <value>1</value>
                  <description>Event 0 from AUX TImer2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOEV_MCU_WU</name>
                  <value>0</value>
                  <description>Edge detect IO event from the DIO(s) which have enabled contribution to IOEV_MCU_WU in [MCU_IOC:IOCFGx.IOEV_MCU_WU_EN]</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED22</name>
              <description>[23:22] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>WU2_EV</name>
              <description>[21:16] MCU Wakeup Source #2

