seanmlyons22/ti-lprf-pacs/svds/cc13x2_26x2.svd
Note: The hardware power management timeout circuit is always enabled.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_LOSS</name>
                  <value>5</value>
                  <description>SCLK_LF, SCLK_MF or SCLK_HF clock loss detect</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDR_LOSS</name>
                  <value>4</value>
                  <description>Brown out detect on VDDR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDS_LOSS</name>
                  <value>2</value>
                  <description>Brown out detect on VDDS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN_RESET</name>
                  <value>1</value>
                  <description>Reset pin</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_ON</name>
                  <value>0</value>
                  <description>Power on reset</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1C0</resetValue>
        </register>
        <register>
          <name>SLEEPCTL</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Sleep Control

This register is used to unfreeze the IO pad ring after waking up from SHUTDOWN</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>IO_PAD_SLEEP_DIS</name>
              <description>[0:0] Controls the I/O pad sleep mode. The boot code will set this bitfield automatically unless waking up from a SHUTDOWN ( RESETCTL.WU_FROM_SD is set).

0: I/O pad sleep mode is enabled, meaning all outputs and pad configurations are latched. Inputs are transparent if pad is configured as input before IO_PAD_SLEEP_DIS is set to 1
1: I/O pad sleep mode is disabled

Application software must reconfigure the state for all IO's before setting this bitfield upon waking up from a SHUTDOWN to avoid glitches on pins.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>JTAGCFG</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>JTAG Configuration

This register contains control for configuration of the JTAG domain. This includes permissions for each TAP.</description>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>JTAG_PD_FORCE_ON</name>
              <description>[8:8] Controls JTAG Power domain power state:

0: Controlled exclusively by debug subsystem. (JTAG Power domain will be powered off unless a debugger is attached)
1: JTAG Power Domain is forced on, independent of debug subsystem.

Note: The reset value causes JTAG Power domain to be powered on by default. Software must clear this bit to turn off the JTAG Power domain</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[7:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x100</resetValue>
        </register>
        <register>
          <name>JTAGUSERCODE</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>JTAG USERCODE

Boot code copies the JTAG USERCODE to this register from where it is forwarded to the debug subsystem.</description>
          <fields>
            <field>
              <name>USER_CODE</name>
              <description>[31:0] 32-bit JTAG USERCODE register feeding main JTAG TAP
Note: This field can be locked by LOCKCFG.LOCK</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xB99A02F</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AON_RTC</name>
      <baseAddress>0x40092000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <description>This component control the Real Time Clock residing in AON

Note: This module is only supporting 32 bit ReadWrite access.</description>
      <registers>
        <register>
          <name>CTL</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Control

This register contains various  bitfields for configuration of RTC
RTL Name = CONFIG</description>
          <fields>
            <field>
              <name>RESERVED19</name>
              <description>[31:19] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>13</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>COMB_EV_MASK</name>
              <description>[18:16] Eventmask selecting which delayed events that form the combined event.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>16</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH2</name>
                  <value>4</value>
                  <description>Use Channel 2 delayed event in combined event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1</name>
                  <value>2</value>
                  <description>Use Channel 1 delayed event in combined event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH0</name>
                  <value>1</value>
                  <description>Use Channel 0 delayed event in combined event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>No event is selected for combined event.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[15:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>EV_DELAY</name>
              <description>[11:8] Number of SCLK_LF clock cycles waited before generating delayed events. (Common setting for all RTC cannels)  the delayed event is delayed</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D144</name>
                  <value>13</value>
                  <description>Delay by 144 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D128</name>
                  <value>12</value>
                  <description>Delay by 128 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D112</name>
                  <value>11</value>
                  <description>Delay by 112 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D96</name>
                  <value>10</value>
                  <description>Delay by 96 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D80</name>
                  <value>9</value>
                  <description>Delay by 80 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D64</name>
                  <value>8</value>
                  <description>Delay by 64 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D48</name>
                  <value>7</value>
                  <description>Delay by 48 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D32</name>
                  <value>6</value>
                  <description>Delay by 32 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16</name>
                  <value>5</value>
                  <description>Delay by 16 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D8</name>
                  <value>4</value>
                  <description>Delay by 8 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D4</name>
                  <value>3</value>
                  <description>Delay by 4 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D2</name>
                  <value>2</value>
                  <description>Delay by 2 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D1</name>
                  <value>1</value>
                  <description>Delay by 1 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D0</name>
                  <value>0</value>
                  <description>No delay on delayed event</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESET</name>
              <description>[7:7] RTC Counter reset.

Writing 1 to this bit will reset the RTC counter.

This bit is cleared when reset takes effect</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[6:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RTC_4KHZ_EN</name>
              <description>[2:2] RTC_4KHZ is a 4 KHz reference output, tapped from  SUBSEC.VALUE  bit 19 which is used by AUX timer.

0: RTC_4KHZ signal is forced to 0
1: RTC_4KHZ is enabled ( provied that RTC is enabled EN)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RTC_UPD_EN</name>
              <description>[1:1] RTC_UPD is a 16 KHz signal used to sync up the radio timer. The 16 Khz is SCLK_LF divided by 2

0: RTC_UPD signal is forced to 0
1: RTC_UPD signal is toggling @16 kHz</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Enable RTC counter

0: Halted (frozen)
1: Running</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVFLAGS</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Event Flags, RTC Status

This register contains event flags from the 3 RTC channels. Each flag will be cleared when writing a '1' to the corresponding bitfield.</description>
          <fields>
            <field>
              <name>RESERVED17</name>
              <description>[31:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>CH2</name>
              <description>[16:16] Channel 2 event flag, set when CHCTL.CH2_EN = 1 and the RTC value matches or passes the CH2CMP value.

An event will be scheduled to occur as soon as possible when writing to CH2CMP provided that the channel is enabled and the new value matches any time between next  RTC value and 1 second in the past

Writing 1 clears this flag.

AUX_SCE can read the flag through AUX_EVCTL:EVSTAT2.AON_RTC_CH2 and clear it using AUX_SYSIF:RTCEVCLR.RTC_CH2_EV_CLR.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[15:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>CH1</name>
              <description>[8:8] Channel 1 event flag, set when CHCTL.CH1_EN = 1 and one of the following:
- CHCTL.CH1_CAPT_EN = 0 and the RTC value matches or passes the CH1CMP value.
- CHCTL.CH1_CAPT_EN = 1 and capture occurs.

An event will be scheduled to occur as soon as possible when writing to CH1CMP provided that the channel is enabled, in compare mode and the new value matches any time between next  RTC value and 1 second in the past.

Writing 1 clears this flag.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CH0</name>
              <description>[0:0] Channel 0 event flag, set when CHCTL.CH0_EN = 1 and the RTC value matches or passes the CH0CMP value.

