seanmlyons22/ti-lprf-pacs/svds/cc13x2_26x2.svd
0: Disable DAC.
1: Enable DAC.

The Sensor Controller must not use the DAC when AUX_SYSIF:OPMODEREQ.REQ equals PDA.

The System CPU must not use the DAC when AUX_SYSIF:OPMODEREQ.REQ equals PDA in Standby TI-RTOS power mode. The System CPU must set AUX_SYSIF:PEROPRATE.ANAIF_DAC_OP_RATE to BUS_RATE to use the DAC in Active and Idle TI-RTOS power modes.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>DAC_BUFFER_EN</name>
              <description>[4:4] DAC buffer enable.

DAC buffer reduces the time required to produce the programmed voltage at the expense of increased current consumption.

0: Disable DAC buffer.
1: Enable DAC buffer.

Enable buffer when DAC_VOUT_SEL equals COMPA_IN.

Do not enable the buffer when AUX_SYSIF:OPMODEREQ.REQ equals PDA or PDLP.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DAC_PRECHARGE_EN</name>
              <description>[3:3] DAC precharge enable.

Only enable precharge when ADI_4_AUX:MUX2.DAC_VREF_SEL equals DCOUPL and VDDS is higher than 2.65 V.

DAC output voltage range:

0: 0 V to 1.28 V.
1: 1.28 V to 2.56 V.

Otherwise, see ADI_4_AUX:MUX2.DAC_VREF_SEL for DAC output voltage range.

Enable precharge 1 us before you enable the DAC and the buffer.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>DAC_VOUT_SEL</name>
              <description>[2:0] DAC output connection.

An analog node must only have one driver. Other drivers for the following analog nodes are configured in [ANATOP_MMAP::ADI_4_AUX:*].</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPA_IN</name>
                  <value>4</value>
                  <description>Connect to COMPA_IN analog node.

Required setting to drive external load selected in ADI_4_AUX:MUX1.COMPA_IN.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPA_REF</name>
                  <value>2</value>
                  <description>Connect to COMPA_REF analog node.

It is not possible to drive external loads connected to COMPA_REF I/O mux with this setting.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPB_REF</name>
                  <value>1</value>
                  <description>Connect to COMPB_REF analog node.

Required setting to use Comparator B.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NC</name>
                  <value>0</value>
                  <description>Connect to nothing

It is recommended to use NC as intermediate step when you change DAC_VOUT_SEL.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>LPMBIASCTL</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>Low Power Mode Bias Control

The low power mode bias module provides bias current to DAC and Comparator A when AUX_SYSIF:OPMODEREQ.REQ differers from A.</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Module enable.

0: Disable low power mode bias module.
1: Enable low power mode bias module.

Set EN to 1 15 us before you enable the DAC or Comparator A.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DACSMPLCTL</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>DAC Sample Control

The DAC sample clock maintains the DAC voltage stored in the sample-and-hold capacitor. The DAC sample clock waveform consists of a setup phase followed by a hold phase. In the setup phase the sample-and-hold capacitor charges to the programmed voltage. The hold phase  maintains the voltage with minimal power.

DACSMPLCFG0 and DACSMPLCFG1 configure the DAC sample clock waveform.</description>
          <fields>
            <field>
              <name>RESERVED7</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] DAC sample clock enable.

0: Disable sample clock. The sample clock stops low and DACSTAT becomes 0 when the current sample clock period completes.
1: Enable DAC sample clock. DACSTAT must be 0 before you enable sample clock.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DACSMPLCFG0</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>DAC Sample Configuration 0</description>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>[31:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>[5:0] Clock division.

AUX_SYSIF:PEROPRATE.ANAIF_DAC_OP_RATE divided by (CLKDIV + 1) determines the sample clock base frequency.

0: Divide by 1.
1: Divide by 2.
...
63: Divide by 64.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DACSMPLCFG1</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>DAC Sample Configuration 1

The sample clock period equals (high time + low time) * base period. DACSMPLCFG0.CLKDIV determines the base period.

Timing  requirements (DAC Buffer On / DAC Buffer Off):
- (high time + low time) * base period &gt; (4 us / 1 us)
- (high time * base period) &gt; (2 us / 0.5 us)
- (low time * base period)  &gt; (2 us / 0.5 us)
- (low time * base period + HOLD_INTERVAL * sample clock period) &lt; 32 us

