seanmlyons22/ti-lprf-pacs/svds/cc13x2_26x2.svd
Sticky Request for Single Semaphore.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SMPH_ID</name>
              <description>[2:0] Write the semaphore ID,0x0-0x7, to SMPH_ID to request this semaphore until it is granted.

When semaphore SMPH_ID is granted, event  AUX_EVCTL:EVSTAT3.AUX_SMPH_AUTOTAKE_DONE becomes 1.

The event becomes 0 when software releases the semaphore or writes a new value to SMPH_ID.

To avoid corrupted semaphores:
- Usage of this functionality must be restricted to one CPU core.
- Software must wait until AUX_EVCTL:EVSTAT3.AUX_SMPH_AUTOTAKE_DONE is 1 before it writes a new value to SMPH_ID.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_SPIM</name>
      <baseAddress>0x400C1000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>The AUX Serial Peripheral Interface Master (AUX_SPIM) enables AUX_SCE with power-efficient SPI communication.

It is not possible to write a register while SPI transmission occurs. An attempt to do so will stall the bus until transmission is complete.

Read of RX8.DATA or RX16.DATA stalls the bus until LSB has been captured. Read of SCLKIDLE.STAT or DATAIDLE.STAT stalls the bus until condition described is met. Other read operations do not stall the bus.

AUX_SCE becomes clock gated if it encounters a bus stall. This is useful as AUX_SCE can write TX8.DATA and then read RX8.DATA immediately to read a SPI slave. In such case there is no need for software to wait or to poll registers.

AUX_SYSIF:PEROPRATE.SPIM_OP_RATE selects the peripheral clock frequency which is used to derive the SCLK frequency.

AUX_SCE must set AUX_SYSIF:PEROPRATE.SPIM_OP_RATE to SCE_RATE to access and use AUX_SPIM. System CPU must set AUX_SYSIF:PEROPRATE.SPIM_OP_RATE to BUS_RATE to access and use AUX_SPIM. Failure to do so can result in incorrect SPI transmission.</description>
      <registers>
        <register>
          <name>SPIMCFG</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>SPI Master Configuration

Write operation stalls until current transfer completes.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DIV</name>
              <description>[7:2] SCLK divider.

Peripheral clock frequency division gives the SCLK clock frequency. The division factor equals (2 * (DIV+1)):

0x00: Divide by 2.
0x01: Divide by 4.
0x02: Divide by 6.
...
0x3F: Divide by 128.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PHA</name>
              <description>[1:1] Phase of the MOSI and MISO data signals.

0: Sample MISO at leading (odd) edges and shift MOSI at trailing (even) edges of SCLK.
1: Sample MISO at trailing (even) edges and shift MOSI at leading (odd) edges of SCLK.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>POL</name>
              <description>[0:0] Polarity of the SCLK signal.

0: SCLK is low when idle, first clock edge rises.
1: SCLK is high when idle, first clock edge falls.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MISOCFG</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>MISO Configuration

Write operation stalls until current transfer completes.</description>
          <fields>
            <field>
              <name>RESERVED5</name>
              <description>[31:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>AUXIO</name>
              <description>[4:0] AUXIO to MISO mux.

Select the AUXIO pin that connects to MISO.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MOSICTL</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>MOSI Control

Write operation stalls until current transfer completes.</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[0:0] MOSI level control.

0: Set MOSI low.
1: Set MOSI high.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TX8</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Transmit 8 Bit

Write operation stalls until current transfer completes.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DATA</name>
              <description>[7:0] 8 bit data transfer.

