seanmlyons22/ti-lprf-pacs/svds/cc13x2_26x2.svd
Result of last TDC conversion.</description>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[24:0] TDC conversion result.

The result of the TDC conversion is given in number of clock edges of the clock source selected in DDI_0_OSC:CTL0.ACLK_TDC_SRC_SEL. Both rising and falling edges are counted.

If TDC counter saturates, VALUE is slightly higher than SATCFG.LIMIT, as it takes a non-zero time to stop the measurement. Hence, the maximum value of this field becomes slightly higher than 2^24 if you configure SATCFG.LIMIT to R24.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x2</resetValue>
        </register>
        <register>
          <name>SATCFG</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Saturation Configuration</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>LIMIT</name>
              <description>[3:0] Saturation limit.

The flag STAT.SAT is set when the TDC counter saturates.

Values not enumerated are not supported</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R24</name>
                  <value>15</value>
                  <description>Result bit 24: TDC conversion saturates and stops when RESULT.VALUE[24] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R23</name>
                  <value>14</value>
                  <description>Result bit 23: TDC conversion saturates and stops when RESULT.VALUE[23] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R22</name>
                  <value>13</value>
                  <description>Result bit 22: TDC conversion saturates and stops when RESULT.VALUE[22] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R21</name>
                  <value>12</value>
                  <description>Result bit 21: TDC conversion saturates and stops when RESULT.VALUE[21] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R20</name>
                  <value>11</value>
                  <description>Result bit 20: TDC conversion saturates and stops when RESULT.VALUE[20] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R19</name>
                  <value>10</value>
                  <description>Result bit 19: TDC conversion saturates and stops when RESULT.VALUE[19] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R18</name>
                  <value>9</value>
                  <description>Result bit 18: TDC conversion saturates and stops when RESULT.VALUE[18] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R17</name>
                  <value>8</value>
                  <description>Result bit 17: TDC conversion saturates and stops when RESULT.VALUE[17] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R16</name>
                  <value>7</value>
                  <description>Result bit 16: TDC conversion saturates and stops when RESULT.VALUE[16] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R15</name>
                  <value>6</value>
                  <description>Result bit 15: TDC conversion saturates and stops when RESULT.VALUE[15] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R14</name>
                  <value>5</value>
                  <description>Result bit 14: TDC conversion saturates and stops when RESULT.VALUE[14] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R13</name>
                  <value>4</value>
                  <description>Result bit 13: TDC conversion saturates and stops when RESULT.VALUE[13] is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R12</name>
                  <value>3</value>
                  <description>Result bit 12: TDC conversion saturates and stops when RESULT.VALUE[12] is set.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xF</resetValue>
        </register>
        <register>
          <name>TRIGSRC</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Trigger Source

Select source and polarity for TDC start and stop events. See the Technical Reference Manual for event timing requirements.</description>
          <fields>
            <field>
              <name>RESERVED15</name>
              <description>[31:15] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>17</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>STOP_POL</name>
              <description>[14:14] Polarity of stop source.

Change only while STAT.STATE is IDLE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>TDC conversion stops when low level is detected.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>TDC conversion stops when high level is detected.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_SRC</name>
              <description>[13:8] Select stop source from the asynchronous AUX event bus.

Change only while STAT.STATE is IDLE.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EVENT</name>
                  <value>63</value>
                  <description>No event.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TDC_PRE</name>
                  <value>62</value>
                  <description>Select TDC Prescaler event which is generated by configuration of PRECTL.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SMPH_AUTOTAKE_DONE</name>
                  <value>61</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_SMPH_AUTOTAKE_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_FIFO_NOT_EMPTY</name>
                  <value>60</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_ADC_FIFO_NOT_EMPTY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_FIFO_ALMOST_FULL</name>
                  <value>59</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_ADC_FIFO_ALMOST_FULL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_IRQ</name>
                  <value>58</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_ADC_IRQ</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_DONE</name>
                  <value>57</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_ADC_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ISRC_RESET_N</name>
                  <value>56</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_ISRC_RESET_N</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TDC_DONE</name>
                  <value>55</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TDC_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER0_EV</name>
                  <value>54</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER0_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER1_EV</name>
                  <value>53</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER1_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_PULSE</name>
                  <value>52</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER2_PULSE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV3</name>
                  <value>51</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV2</name>
                  <value>50</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV1</name>
                  <value>49</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV0</name>
                  <value>48</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <value>47</value>
                  <description>AUX_EVCTL:EVSTAT2.AUX_COMPB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <value>46</value>
                  <description>AUX_EVCTL:EVSTAT2.AUX_COMPA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_OBSMUX1</name>
                  <value>45</value>
                  <description>AUX_EVCTL:EVSTAT2.MCU_OBSMUX1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_OBSMUX0</name>
                  <value>44</value>
                  <description>AUX_EVCTL:EVSTAT2.MCU_OBSMUX0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_EV</name>
                  <value>43</value>
                  <description>AUX_EVCTL:EVSTAT2.MCU_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK_REF</name>
                  <value>42</value>
                  <description>AUX_EVCTL:EVSTAT2.ACLK_REF</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDR_RECHARGE</name>
                  <value>41</value>
                  <description>AUX_EVCTL:EVSTAT2.VDDR_RECHARGE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_ACTIVE</name>
                  <value>40</value>
                  <description>AUX_EVCTL:EVSTAT2.MCU_ACTIVE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_DWN</name>
                  <value>39</value>
                  <description>AUX_EVCTL:EVSTAT2.PWR_DWN</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCLK_LF</name>
                  <value>38</value>
                  <description>AUX_EVCTL:EVSTAT2.SCLK_LF</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_BATMON_TEMP_UPD</name>
                  <value>37</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_BATMON_TEMP_UPD</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_BATMON_BAT_UPD</name>
                  <value>36</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_BATMON_BAT_UPD</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_4KHZ</name>
                  <value>35</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_RTC_4KHZ</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_CH2_DLY</name>
                  <value>34</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_CH2</name>
                  <value>33</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_RTC_CH2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MANUAL_EV</name>
                  <value>32</value>
                  <description>AUX_EVCTL:EVSTAT2.MANUAL_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO31</name>
                  <value>31</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO31</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO30</name>
                  <value>30</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO30</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO29</name>
                  <value>29</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO29</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO28</name>
                  <value>28</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO28</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO27</name>
                  <value>27</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO27</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO26</name>
                  <value>26</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO26</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO25</name>
                  <value>25</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO25</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO24</name>
                  <value>24</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO24</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO23</name>
                  <value>23</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO23</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO22</name>
                  <value>22</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO22</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO21</name>
                  <value>21</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO21</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO20</name>
                  <value>20</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO20</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO19</name>
                  <value>19</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO19</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO18</name>
                  <value>18</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO18</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO17</name>
                  <value>17</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO17</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO16</name>
                  <value>16</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO15</name>
                  <value>15</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO14</name>
                  <value>14</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO13</name>
                  <value>13</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO12</name>
                  <value>12</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO11</name>
                  <value>11</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO10</name>
                  <value>10</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO9</name>
                  <value>9</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO8</name>
                  <value>8</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO7</name>
                  <value>7</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO6</name>
                  <value>6</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO5</name>
                  <value>5</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO4</name>
                  <value>4</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO3</name>
                  <value>3</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO2</name>
                  <value>2</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO1</name>
                  <value>1</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO0</name>
                  <value>0</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>[7:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>START_POL</name>
              <description>[6:6] Polarity of start source.

Change only while STAT.STATE is IDLE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>TDC conversion starts when low level is detected.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>TDC conversion starts when high level is detected.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_SRC</name>
              <description>[5:0] Select start source from the asynchronous AUX event bus.

