seanmlyons22/ti-lprf-pacs/svds/cc13x2_26x2.svd
        <register>
          <name>FCFG_B3_SSIZE0</name>
          <addressOffset>0x2460</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>B3_SECT_SIZE</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B3_SSIZE1</name>
          <addressOffset>0x2464</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B3_SSIZE2</name>
          <addressOffset>0x2468</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B3_SSIZE3</name>
          <addressOffset>0x246c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B4_SSIZE0</name>
          <addressOffset>0x2470</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>B4_SECT_SIZE</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B4_SSIZE1</name>
          <addressOffset>0x2474</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B4_SSIZE2</name>
          <addressOffset>0x2478</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B4_SSIZE3</name>
          <addressOffset>0x247c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B5_SSIZE0</name>
          <addressOffset>0x2480</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>B5_SECT_SIZE</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B5_SSIZE1</name>
          <addressOffset>0x2484</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B5_SSIZE2</name>
          <addressOffset>0x2488</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B5_SSIZE3</name>
          <addressOffset>0x248c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B6_SSIZE0</name>
          <addressOffset>0x2490</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>B6_SECT_SIZE</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B6_SSIZE1</name>
          <addressOffset>0x2494</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B6_SSIZE2</name>
          <addressOffset>0x2498</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B6_SSIZE3</name>
          <addressOffset>0x249c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B7_SSIZE0</name>
          <addressOffset>0x24a0</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>B7_SECT_SIZE</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B7_SSIZE1</name>
          <addressOffset>0x24a4</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B7_SSIZE2</name>
          <addressOffset>0x24a8</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B7_SSIZE3</name>
          <addressOffset>0x24ac</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
