seanmlyons22/ti-lprf-pacs/svds/cc13x2_26x2.svd
        <register>
          <name>RFCPEIFG</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Interrupt Flags For Command and Packet Engine Generated Interrupts</description>
          <fields>
            <field>
              <name>INTERNAL_ERROR</name>
              <description>[31:31] Interrupt flag 31. The command and packet engine (CPE) has observed an unexpected error. A reset of the CPE is needed. This can be done by switching the RF Core power domain off and on in PRCM:PDCTL1RFC. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>BOOT_DONE</name>
              <description>[30:30] Interrupt flag 30. The command and packet engine (CPE) boot is finished. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>MODULES_UNLOCKED</name>
              <description>[29:29] Interrupt flag 29. As part of command and packet engine (CPE) boot process, it has opened access to RF Core modules and memories. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>SYNTH_NO_LOCK</name>
              <description>[28:28] Interrupt flag 28. The phase-locked loop in frequency synthesizer has reported loss of lock. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>IRQ27</name>
              <description>[27:27] Interrupt flag 27. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>RX_ABORTED</name>
              <description>[26:26] Interrupt flag 26. Packet reception stopped before packet was done. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>RX_N_DATA_WRITTEN</name>
              <description>[25:25] Interrupt flag 25. Specified number of bytes written to partial read Rx buffer. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>RX_DATA_WRITTEN</name>
              <description>[24:24] Interrupt flag 24. Data written to partial read Rx buffer. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RX_ENTRY_DONE</name>
              <description>[23:23] Interrupt flag 23. Rx queue data entry changing state to finished.  Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>RX_BUF_FULL</name>
              <description>[22:22] Interrupt flag 22. Packet received that did not fit in Rx queue. BLE mode: Packet received that did not fit in the Rx queue. IEEE 802.15.4 mode: Frame received that did not fit in the Rx queue. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>RX_CTRL_ACK</name>
              <description>[21:21] Interrupt flag 21. BLE mode only: LL control packet received with CRC OK, not to be ignored, then acknowledgement sent. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>RX_CTRL</name>
              <description>[20:20] Interrupt flag 20. BLE mode only: LL control packet received with CRC OK, not to be ignored. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>RX_EMPTY</name>
              <description>[19:19] Interrupt flag 19. BLE mode only: Packet received with CRC OK, not to be ignored, no payload. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>RX_IGNORED</name>
              <description>[18:18] Interrupt flag 18. Packet received, but can be ignored. BLE mode: Packet received with CRC OK, but to be ignored. IEEE 802.15.4 mode: Frame received with ignore flag set. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>RX_NOK</name>
              <description>[17:17] Interrupt flag 17. Packet received with CRC error. BLE mode: Packet received with CRC error. IEEE 802.15.4 mode: Frame received with CRC error. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>RX_OK</name>
              <description>[16:16] Interrupt flag 16. Packet received correctly. BLE mode: Packet received with CRC OK, payload, and not to be ignored. IEEE 802.15.4 mode: Frame received with CRC OK. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>IRQ15</name>
              <description>[15:15] Interrupt flag 15. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>IRQ14</name>
              <description>[14:14] Interrupt flag 14. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>FG_COMMAND_STARTED</name>
              <description>[13:13] Interrupt flag 13. IEEE 802.15.4 mode only: A foreground radio operation command has gone into active state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>COMMAND_STARTED</name>
              <description>[12:12] Interrupt flag 12. A radio operation command has gone into active state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>TX_BUFFER_CHANGED</name>
              <description>[11:11] Interrupt flag 11. BLE mode only: A buffer change is complete after CMD_BLE_ADV_PAYLOAD. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>TX_ENTRY_DONE</name>
              <description>[10:10] Interrupt flag 10. Tx queue data entry state changed to finished. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>TX_RETRANS</name>
              <description>[9:9] Interrupt flag 9. BLE mode only: Packet retransmitted. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>TX_CTRL_ACK_ACK</name>
              <description>[8:8] Interrupt flag 8. BLE mode only: Acknowledgement received on a transmitted LL control packet, and acknowledgement transmitted for that packet. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TX_CTRL_ACK</name>
              <description>[7:7] Interrupt flag 7. BLE mode: Acknowledgement received on a transmitted LL control packet. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>TX_CTRL</name>
              <description>[6:6] Interrupt flag 6. BLE mode: Transmitted LL control packet. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>TX_ACK</name>
              <description>[5:5] Interrupt flag 5. BLE mode: Acknowledgement received on a transmitted packet. IEEE 802.15.4 mode: Transmitted automatic ACK frame. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>TX_DONE</name>
              <description>[4:4] Interrupt flag 4. Packet transmitted. (BLE mode: A packet has been transmitted.) (IEEE 802.15.4 mode: A frame has been transmitted). Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>LAST_FG_COMMAND_DONE</name>
              <description>[3:3] Interrupt flag 3. IEEE 802.15.4 mode only: The last foreground radio operation command in a chain of commands has finished. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>FG_COMMAND_DONE</name>
              <description>[2:2] Interrupt flag 2. IEEE 802.15.4 mode only: A foreground radio operation command has finished. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>LAST_COMMAND_DONE</name>
              <description>[1:1] Interrupt flag 1. The last radio operation command in a chain of commands has finished. (IEEE 802.15.4 mode: The last background level radio operation command in a chain of commands has finished.) Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>COMMAND_DONE</name>
              <description>[0:0] Interrupt flag 0. A radio operation has finished. (IEEE 802.15.4 mode: A background level radio operation command has finished.) Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RFCPEIEN</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Interrupt Enable For Command and Packet Engine Generated Interrupts</description>
          <fields>
            <field>
              <name>INTERNAL_ERROR</name>
              <description>[31:31] Interrupt enable for RFCPEIFG.INTERNAL_ERROR.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>BOOT_DONE</name>
              <description>[30:30] Interrupt enable for RFCPEIFG.BOOT_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>MODULES_UNLOCKED</name>
              <description>[29:29] Interrupt enable for RFCPEIFG.MODULES_UNLOCKED.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>SYNTH_NO_LOCK</name>
              <description>[28:28] Interrupt enable for RFCPEIFG.SYNTH_NO_LOCK.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>IRQ27</name>
              <description>[27:27] Interrupt enable for RFCPEIFG.IRQ27.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>RX_ABORTED</name>
              <description>[26:26] Interrupt enable for RFCPEIFG.RX_ABORTED.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>RX_N_DATA_WRITTEN</name>
              <description>[25:25] Interrupt enable for RFCPEIFG.RX_N_DATA_WRITTEN.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>RX_DATA_WRITTEN</name>
              <description>[24:24] Interrupt enable for RFCPEIFG.RX_DATA_WRITTEN.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RX_ENTRY_DONE</name>
              <description>[23:23] Interrupt enable for RFCPEIFG.RX_ENTRY_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>RX_BUF_FULL</name>
              <description>[22:22] Interrupt enable for RFCPEIFG.RX_BUF_FULL.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>RX_CTRL_ACK</name>
              <description>[21:21] Interrupt enable for RFCPEIFG.RX_CTRL_ACK.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>RX_CTRL</name>
              <description>[20:20] Interrupt enable for RFCPEIFG.RX_CTRL.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>RX_EMPTY</name>
              <description>[19:19] Interrupt enable for RFCPEIFG.RX_EMPTY.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>RX_IGNORED</name>
              <description>[18:18] Interrupt enable for RFCPEIFG.RX_IGNORED.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>RX_NOK</name>
              <description>[17:17] Interrupt enable for RFCPEIFG.RX_NOK.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>RX_OK</name>
              <description>[16:16] Interrupt enable for RFCPEIFG.RX_OK.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>IRQ15</name>
              <description>[15:15] Interrupt enable for RFCPEIFG.IRQ15.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>IRQ14</name>
              <description>[14:14] Interrupt enable for RFCPEIFG.IRQ14.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>FG_COMMAND_STARTED</name>
              <description>[13:13] Interrupt enable for RFCPEIFG.FG_COMMAND_STARTED.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>COMMAND_STARTED</name>
              <description>[12:12] Interrupt enable for RFCPEIFG.COMMAND_STARTED.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>TX_BUFFER_CHANGED</name>
              <description>[11:11] Interrupt enable for RFCPEIFG.TX_BUFFER_CHANGED.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>TX_ENTRY_DONE</name>
              <description>[10:10] Interrupt enable for RFCPEIFG.TX_ENTRY_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>TX_RETRANS</name>
              <description>[9:9] Interrupt enable for RFCPEIFG.TX_RETRANS.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>TX_CTRL_ACK_ACK</name>
              <description>[8:8] Interrupt enable for RFCPEIFG.TX_CTRL_ACK_ACK.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TX_CTRL_ACK</name>
              <description>[7:7] Interrupt enable for RFCPEIFG.TX_CTRL_ACK.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>TX_CTRL</name>
              <description>[6:6] Interrupt enable for RFCPEIFG.TX_CTRL.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>TX_ACK</name>
              <description>[5:5] Interrupt enable for RFCPEIFG.TX_ACK.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>TX_DONE</name>
              <description>[4:4] Interrupt enable for RFCPEIFG.TX_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>LAST_FG_COMMAND_DONE</name>
              <description>[3:3] Interrupt enable for RFCPEIFG.LAST_FG_COMMAND_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>FG_COMMAND_DONE</name>
              <description>[2:2] Interrupt enable for RFCPEIFG.FG_COMMAND_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>LAST_COMMAND_DONE</name>
              <description>[1:1] Interrupt enable for RFCPEIFG.LAST_COMMAND_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>COMMAND_DONE</name>
              <description>[0:0] Interrupt enable for RFCPEIFG.COMMAND_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
