seanmlyons22/ti-lprf-pacs/svds/cc13x2_26x2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RFC_PWR</name>
      <baseAddress>0x40040000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <description>RF core power management

This module contains clock control for all RF core sub-modules.</description>
      <registers>
        <register>
          <name>PWMCLKEN</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>RF Core Power Management and Clock Enable</description>
          <fields>
            <field>
              <name>RESERVED11</name>
              <description>[31:11] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>21</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>RFCTRC</name>
              <description>[10:10] Enable clock to the RF Core Tracer (RFCTRC) module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>FSCA</name>
              <description>[9:9] Enable clock to the Frequency Synthesizer Calibration Accelerator (FSCA) module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PHA</name>
              <description>[8:8] Enable clock to the Packet Handling Accelerator (PHA) module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RAT</name>
              <description>[7:7] Enable clock to the Radio Timer (RAT) module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RFERAM</name>
              <description>[6:6] Enable clock to the RF Engine RAM module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RFE</name>
              <description>[5:5] Enable clock to the RF Engine (RFE) module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>MDMRAM</name>
              <description>[4:4] Enable clock to the Modem RAM module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MDM</name>
              <description>[3:3] Enable clock to the Modem (MDM) module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CPERAM</name>
              <description>[2:2] Enable clock to the Command and Packet Engine (CPE) RAM module. As part of RF Core initialization, set this bit together with CPE bit to enable CPE to boot.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CPE</name>
              <description>[1:1] Enable processor clock (hclk) to the Command and Packet Engine (CPE). As part of RF Core initialization, set this bit together with CPERAM bit to enable CPE to boot.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RFC</name>
              <description>[0:0] Enable essential clocks for the RF Core interface. This includes the interconnect, the radio doorbell DBELL command interface, the power management (PWR) clock control module, and bus clock (sclk) for the CPE. To remove possibility of locking yourself out from the RF Core, this bit can not be cleared. If you need to disable all clocks to the RF Core, see the PRCM:RFCCLKG.CLK_EN register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RFC_RAT</name>
      <baseAddress>0x40043000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <description>RF core radio timer</description>
      <registers>
        <register>
          <name>RATCNT</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Radio Timer Counter Value</description>
          <fields>
            <field>
              <name>CNT</name>
              <description>[31:0] Counter value. This is not writable while radio timer counter is enabled.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RATCH0VAL</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>Timer Channel 0 Capture/Compare Register</description>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] Capture/compare value. Only writable when the channel is configured for compare mode. In compare mode, a write to this register will auto-arm the channel.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RATCH1VAL</name>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <description>Timer Channel 1 Capture/Compare Register</description>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] Capture/compare value. Only writable when the channel is configured for compare mode. In compare mode, a write to this register will auto-arm the channel.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RATCH2VAL</name>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <description>Timer Channel 2 Capture/Compare Register</description>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] Capture/compare value. Only writable when the channel is configured for compare mode. In compare mode, a write to this register will auto-arm the channel.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RATCH3VAL</name>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <description>Timer Channel 3 Capture/Compare Register</description>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] Capture/compare value. Only writable when the channel is configured for compare mode. In compare mode, a write to this register will auto-arm the channel.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RATCH4VAL</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>Timer Channel 4 Capture/Compare Register</description>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] Capture/compare value. Only writable when the channel is configured for compare mode. In compare mode, a write to this register will auto-arm the channel.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RATCH5VAL</name>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <description>Timer Channel 5 Capture/Compare Register</description>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] Capture/compare value. Only writable when the channel is configured for compare mode. In compare mode, a write to this register will auto-arm the channel.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RATCH6VAL</name>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <description>Timer Channel 6 Capture/Compare Register</description>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] Capture/compare value. Only writable when the channel is configured for compare mode. In compare mode, a write to this register will auto-arm the channel.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RATCH7VAL</name>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <description>Timer Channel 7 Capture/Compare Register</description>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] Capture/compare value. Only writable when the channel is configured for compare mode. In compare mode, a write to this register will auto-arm the channel.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
