seanmlyons22/ti-lprf-pacs/svds/cc13x2_26x2.svd
This bit can only be set to '1' when TEST_MODE is also set to '1' and should not be used for other than test purposes</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TEST_MODE</name>
              <description>[1:1] 1: Enables access to the TESTCNT and LFSR0/LFSR1/LFSR2 registers (the latter are automatically cleared before enabling access)  and keeps IRQFLAGSTAT.NEED_CLOCK at '1'.

This bit shall not be used unless you need to change the LFSR seed prior to creating a new random value. All other testing is done external to register control.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CFG0</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Configuration 0</description>
          <fields>
            <field>
              <name>MAX_REFILL_CYCLES</name>
              <description>[31:16] This field determines the maximum number of samples (between 2^8 and 2^24) taken to re-generate entropy from the FROs after reading out a 64 bits random number. If the written value of this field is zero, the number of samples is 2^24, otherwise the number of samples equals the written value times 2^8.

0x0000: 2^24 samples
0x0001: 1*2^8 samples
0x0002: 2*2^8 samples
0x0003: 3*2^8 samples
...
0x8000: 32768*2^8 samples
0xC000: 49152*2^8 samples
...
0xFFFF: 65535*2^8 samples

This field can only be modified while CTL.TRNG_EN is 0.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[15:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>SMPL_DIV</name>
              <description>[11:8] This field directly controls the number of clock cycles between samples taken from the FROs. Default value 0 indicates that samples are taken every clock cycle,
maximum value 0xF takes one sample every 16 clock cycles.
This field must be set to a value such that the slowest FRO (even under worst-case
conditions) has a cycle time less than twice the sample period.

This field can only be modified while CTL.TRNG_EN is '0'.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MIN_REFILL_CYCLES</name>
              <description>[7:0] This field determines the minimum number of samples (between 2^6 and 2^14) taken to re-generate entropy from the FROs after reading out a 64 bits random number. If the value of this field is zero, the number of samples is fixed to the value determined by the MAX_REFILL_CYCLES field, otherwise the minimum number of samples equals the written value times 64 (which can be up to 2^14). To ensure same entropy in all generated random numbers the value 0 should be used. Then MAX_REFILL_CYCLES controls the minimum refill interval. The number of samples defined here cannot be higher than the number defined by the 'max_refill_cycles' field (i.e. that field takes precedence). No random value will be created if min refill &gt; max refill.

This field can only be modified while CTL.TRNG_EN = 0.

0x00: Minimum samples = MAX_REFILL_CYCLES (all numbers have same entropy)
0x01: 1*2^6 samples
0x02: 2*2^6 samples
...
0xFF: 255*2^6 samples</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ALARMCNT</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Alarm Control</description>
          <fields>
            <field>
              <name>RESERVED30</name>
              <description>[31:30] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>SHUTDOWN_CNT</name>
              <description>[29:24] Read-only, indicates the number of '1' bits in ALARMSTOP register.
The maximum value equals the number of FROs.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED21</name>
              <description>[23:21] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>SHUTDOWN_THR</name>
              <description>[20:16] Threshold setting for generating IRQFLAGSTAT.SHUTDOWN_OVF interrupt. The interrupt is triggered when SHUTDOWN_CNT value exceeds this bit field.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED8</name>
              <description>[15:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ALARM_THR</name>
              <description>[7:0] Alarm detection threshold for the repeating pattern detectors on each FRO. An FRO 'alarm event' is declared when a repeating pattern (of up to four samples length) is detected continuously for the number of samples defined by this field's value. Reset value 0xFF should keep the number of 'alarm events' to a manageable level.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>FROEN</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>FRO Enable</description>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>FRO_MASK</name>
              <description>[23:0] Enable bits for the individual FROs. A '1' in bit [n] enables FRO 'n'. Default state is all '1's to enable all FROs after power-up. Note that they are not actually started up before the CTL.TRNG_EN bit  is set to '1'.

Bits are automatically forced to '0' here (and cannot be written to '1') while the corresponding bit in  ALARMSTOP.FRO_FLAGS has value '1'.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFF</resetValue>
        </register>
        <register>
          <name>FRODETUNE</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>FRO De-tune Bit</description>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>FRO_MASK</name>
              <description>[23:0] De-tune bits for the individual FROs. A '1' in bit [n] lets FRO 'n' run approximately 5% faster. The value of one of these bits may only be changed while the corresponding FRO is turned off (by temporarily writing a '0' in the corresponding
bit of the FROEN.FRO_MASK register).</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ALARMMASK</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Alarm Event</description>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>FRO_MASK</name>
              <description>[23:0] Logging bits for the 'alarm events' of individual FROs. A '1' in bit [n] indicates FRO 'n' experienced an 'alarm event'.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ALARMSTOP</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Alarm Shutdown</description>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>FRO_FLAGS</name>
              <description>[23:0] Logging bits for the 'alarm events' of individual FROs. A '1' in bit [n] indicates FRO 'n' experienced more than one 'alarm event' in quick succession and has been turned off. A '1' in this field forces the corresponding bit in FROEN.FRO_MASK to '0'.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>LFSR0</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>LFSR Readout Value</description>
          <fields>
            <field>
              <name>LFSR_31_0</name>
              <description>[31:0] Bits [31:0] of the main entropy accumulation LFSR. Register can only be accessed when CTL.TEST_MODE  = 1.
Register contents will be cleared to zero before access is enabled.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>LFSR1</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>LFSR Readout Value</description>
          <fields>
            <field>
              <name>LFSR_63_32</name>
              <description>[31:0] Bits [63:32] of the main entropy accumulation LFSR. Register can only be accessed when CTL.TEST_MODE = 1.
Register contents will be cleared to zero before access is enabled.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>LFSR2</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>LFSR Readout Value</description>
          <fields>
            <field>
              <name>RESERVED17</name>
              <description>[31:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>LFSR_80_64</name>
              <description>[16:0] Bits [80:64] of the main entropy accumulation LFSR. Register can only be accessed when CTL.TEST_MODE = 1.
Register contents will be cleared to zero before access is enabled.</description>
              <bitWidth>17</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HWOPT</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>TRNG Engine Options Information</description>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>[31:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>NR_OF_FROS</name>
              <description>[11:6] Number of FROs implemented in this TRNG, value 24 (decimal).</description>
              <bitWidth>6</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[5:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x600</resetValue>
        </register>
        <register>
          <name>HWVER0</name>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <description>HW Version 0
EIP Number And Core Revision</description>
          <fields>
            <field>
              <name>RESERVED28</name>
              <description>[31:28] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>HW_MAJOR_VER</name>
              <description>[27:24] 4 bits binary encoding of the major hardware revision number.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>HW_MINOR_VER</name>
              <description>[23:20] 4 bits binary encoding of the minor hardware revision number.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>HW_PATCH_LVL</name>
              <description>[19:16] 4 bits binary encoding of the hardware patch level, initial release will carry value zero.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>EIP_NUM_COMPL</name>
              <description>[15:8] Bit-by-bit logic complement of bits [7:0]. This TRNG gives 0xB4.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EIP_NUM</name>
              <description>[7:0] 8 bits binary encoding of the module number. This TRNG gives 0x4B.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x200B44B</resetValue>
        </register>
        <register>
          <name>IRQSTATMASK</name>
          <addressOffset>0x1fd8</addressOffset>
          <size>32</size>
          <description>Interrupt Status After Masking</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SHUTDOWN_OVF</name>
              <description>[1:1] Shutdown Overflow (result of IRQFLAGSTAT.SHUTDOWN_OVF AND'ed with IRQFLAGMASK.SHUTDOWN_OVF)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RDY</name>
              <description>[0:0] New random value available (result of IRQFLAGSTAT.RDY AND'ed with IRQFLAGMASK.RDY)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HWVER1</name>
          <addressOffset>0x1fe0</addressOffset>
          <size>32</size>
          <description>HW Version 1
TRNG Revision Number</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>REV</name>
              <description>[7:0] The revision number of this module is Rev 2.0.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x20</resetValue>
        </register>
        <register>
          <name>IRQSET</name>
          <addressOffset>0x1fec</addressOffset>
          <size>32</size>
          <description>Interrupt Set</description>
          <fields>
            <field>
              <name>RDY</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SWRESET</name>
          <addressOffset>0x1ff0</addressOffset>
          <size>32</size>
          <description>SW Reset Control</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RESET</name>
              <description>[0:0] Write '1' to soft reset , reset will be low for 4-5 clock cycles. Poll to 0 for reset to be completed.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IRQSTAT</name>
          <addressOffset>0x1ff8</addressOffset>
          <size>32</size>
          <description>Interrupt Status</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] TRNG Interrupt status. OR'ed version of IRQFLAGSTAT.SHUTDOWN_OVF and IRQFLAGSTAT.RDY</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
