seanmlyons22/ti-lprf-pacs/svds/cc13x2_26x2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UDMA0</name>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>ARM Micro Direct Memory Access Controller</description>
      <registers>
        <register>
          <name>STATUS</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Status</description>
          <fields>
            <field>
              <name>TEST</name>
              <description>[31:28] 0x0: Controller does not include the integration test logic
0x1: Controller includes the integration test logic
0x2: Undefined
...
0xF: Undefined</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>RESERVED21</name>
              <description>[27:21] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>TOTALCHANNELS</name>
              <description>[20:16] Register value returns number of available uDMA channels minus one. For example a read out value of:

0x00: Show that the controller is configured to use 1 uDMA channel
0x01: Shows that the controller is configured to use 2 uDMA channels
...
0x1F: Shows that the controller is configured to use 32 uDMA channels (32-1=31=0x1F)</description>
              <bitWidth>5</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED8</name>
              <description>[15:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>STATE</name>
              <description>[7:4] Current state of the control state machine. State can be one of the following:

0x0: Idle
0x1: Reading channel controller data
0x2: Reading source data end pointer
0x3: Reading destination data end pointer
0x4: Reading source data
0x5: Writing destination data
0x6: Waiting for uDMA request to clear
0x7: Writing channel controller data
0x8: Stalled
0x9: Done
0xA: Peripheral scatter-gather transition
0xB: Undefined
...
0xF: Undefined.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[3:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>MASTERENABLE</name>
              <description>[0:0] Shows the enable status of the controller as configured by CFG.MASTERENABLE:

0: Controller is disabled
1: Controller is enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1F0000</resetValue>
        </register>
        <register>
          <name>CFG</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Configuration</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PRTOCTRL</name>
              <description>[7:5] Sets the AHB-Lite bus protocol protection state by controlling the AHB signal HProt[3:1] as follows:

Bit [7] Controls HProt[3] to indicate if a cacheable access is occurring.
Bit [6] Controls HProt[2] to indicate if a bufferable access is occurring.
Bit [5] Controls HProt[1] to indicate if a privileged access is occurring.

When bit [n] = 1 then the corresponding HProt bit is high.
When bit [n] = 0 then the corresponding HProt bit is low.

This field controls HProt[3:1] signal for all transactions initiated by uDMA except two transactions below:
- the read from the address indicated by source address pointer
- the write to the address indicated by destination address pointer
HProt[3:1] for these two exceptions can be controlled by dedicated fields in the channel configutation descriptor.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[4:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>MASTERENABLE</name>
              <description>[0:0] Enables the controller:

0: Disables the controller
1: Enables the controller</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CTRL</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Channel Control Data Base Pointer</description>
          <fields>
            <field>
              <name>BASEPTR</name>
              <description>[31:10] This register point to the base address for the primary data structures of each DMA channel. This is not stored in module, but in system memory, thus space must be allocated for this usage when DMA is in usage</description>
              <bitWidth>22</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[9:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>10</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ALTCTRL</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Channel Alternate Control Data Base Pointer</description>
          <fields>
            <field>
              <name>BASEPTR</name>
              <description>[31:0] This register shows the base address for the alternate data structures and is calculated by module, thus read only</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x200</resetValue>
        </register>
        <register>
          <name>WAITONREQ</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Channel Wait On Request Status</description>
          <fields>
            <field>
              <name>CHNLSTATUS</name>
              <description>[31:0] Channel wait on request status:

Bit [Ch] = 0: Once uDMA receives a single or burst request on channel Ch, this channel may come out of active state even if request is still present.
Bit [Ch] = 1: Once uDMA receives a single or burst request on channel Ch, it keeps channel Ch in active state until the requests are deasserted. This handshake is necessary for channels where the requester is in an asynchronous domain or can run at slower clock speed than uDMA</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFF1EFF</resetValue>
        </register>
        <register>
          <name>SOFTREQ</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Channel Software Request</description>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>[31:0] Set the appropriate bit to generate a software uDMA request on the corresponding uDMA channel

Bit [Ch] = 0: Does not create a uDMA request for channel Ch
Bit [Ch] = 1: Creates a uDMA request for channel Ch

Writing to a bit where a uDMA channel is not implemented does not create a uDMA request for that channel</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SETBURST</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Channel Set UseBurst</description>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>[31:0] Returns the useburst status, or disables individual channels from generating single uDMA requests. The value R is the arbitration rate and stored in the controller data structure.

