seanmlyons22/ti-lprf-pacs/svds/cc13x2_26x2.svd
0: Static arbitration  (icode/docde &gt; sysbus)
1: Round-robin arbitration</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PREF_EN</name>
              <description>[2:2] Tag prefetch control

0: Disabled
1: Enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MODE</name>
              <description>[1:0] VIMS mode request.
Write accesses to this field will be blocked while STAT.MODE_CHANGING is set to 1.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <value>3</value>
                  <description>VIMS Off mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CACHE</name>
                  <value>1</value>
                  <description>VIMS Cache mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPRAM</name>
                  <value>0</value>
                  <description>VIMS GPRAM mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <baseAddress>0x40080000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Watchdog Timer</description>
      <registers>
        <register>
          <name>LOAD</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Configuration</description>
          <fields>
            <field>
              <name>WDTLOAD</name>
              <description>[31:0] This register is the 32-bit interval value used by the 32-bit counter. When this register is written, the value is immediately loaded and the counter is restarted to count down from the new value. If this register is loaded with 0x0000.0000, an interrupt is immediately generated.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>VALUE</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Current Count Value</description>
          <fields>
            <field>
              <name>WDTVALUE</name>
              <description>[31:0] This register contains the current count value of the timer.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CTL</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Control</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>INTTYPE</name>
              <description>[2:2] WDT Interrupt Type

0:  WDT interrupt is a standard interrupt.
1:  WDT interrupt is a non-maskable interrupt.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONMASKABLE</name>
                  <value>1</value>
                  <description>Non-maskable interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKABLE</name>
                  <value>0</value>
                  <description>Maskable interrupt</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESEN</name>
              <description>[1:1] WDT Reset Enable. Defines the function of the WDT reset source (see PRCM:WARMRESET.WDT_STAT if enabled)

0:  Disabled.
1:  Enable the Watchdog reset output.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Reset output Enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Reset output Disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTEN</name>
              <description>[0:0] WDT Interrupt Enable

0: Interrupt event disabled.
1: Interrupt event enabled. Once set, this bit can only be cleared by a hardware reset.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Interrupt Enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Interrupt Disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Interrupt Clear</description>
          <fields>
            <field>
              <name>WDTICR</name>
              <description>[31:0] This register is the interrupt clear register. A write of any value to this register clears the WDT interrupt and reloads the 32-bit counter from the LOAD register.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RIS</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Raw Interrupt Status</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>WDTRIS</name>
              <description>[0:0] This register is the raw interrupt status register. WDT interrupt events can be monitored via this register if the controller interrupt is masked.

Value Description

